; domain
(define
	(domain traveler)
	(:requirements :adl)
	(:types planet portal lever)
	(:predicates
		(traveler_on_planet ?x - planet)
		(portal_from_to ?x - portal ?y ?z - planet)
		(lever_location ?x - lever ?y - planet)
		(lever_to_portal ?x - lever ?y - portal)
		(portal_open ?x - portal)
		(symbol ?x ?y - planet)
		(barrier_on ?y - lever)
		(barrier_button ?x - barrier ?y - planet)
	)
	
	(:action ciag-za-wajche-kronk
		:parameters (?l - lever ?d - portal)
		:precondition
		(and
			(lever_to_portal ?l ?d)
			(exists (?p - planet)
				(and
					(traveler_on_planet ?p)
					(lever_location ?l ?p)
				)
			)
			(not (barrier_on ?l))
		)
		:effect
		(and
			(portal_open ?d)
		)
	)
	
	(:action portal-travel
		:parameters (?d - portal ?p ?pp - planet)
		:precondition
		(and
			(traveler_on_planet ?p)		
			(portal_open ?d)
			(or 
				(portal_from_to ?d ?p ?pp)
				(portal_from_to ?d ?pp ?p)
			)

		)
		:effect
		(and
			(not (portal_open ?d))
			(traveler_on_planet ?pp)
			(not (traveler_on_planet ?p))
		)
	)
	
	(:action symbol-travel
		:parameters (?p ?pp - planet)
		:precondition
		(and
			(traveler_on_planet ?p)
			(or
				(symbol ?p ?pp)
				(symbol ?pp ?p)
			)

		)
		:effect
		(and
			(not (traveler_on_planet ?p))
			(traveler_on_planet ?pp)
		)
	)
	
	(:action push-button
		:parameters (?l - lever ?p - planet)
		:precondition
		(and
			(barrier_on ?l)
			(barrier_button ?p)
			(traveler_on_planet ?p)
		)
		:effect
		(and
			(not (barrier_on ?l))
		)
	)
	
	
)

; problem
(define (problem p1)
(:domain traveler)
(:objects P1 P2 P3 P4 P5 P6 P7 - planet
			D1 D3 D4 D5 D6 - portal 
			L1 L11 L3 L4 L5 L6 - lever
)
(:init
	(traveler_on_planet P1)
	
	(portal_from_to D1 P1 P2)
	(portal_from_to D3 P3 P4)
	(portal_from_to D4 P3 P5)
	(portal_from_to D5 P1 P6)
	(portal_from_to D6 P6 P7)
	
	(lever_location L1 P1)
	(lever_location L11 P4)
	(lever_location L3 P2)
	(lever_location L4 P4)
	(lever_location L5 P5)
	(lever_location L6 P6)
	
	(lever_to_portal L1 D1)
	(lever_to_portal L11 D1)
	(lever_to_portal L3 D3)
	(lever_to_portal L4 D4)
	(lever_to_portal L5 D5)
	(lever_to_portal L6 D6)
	
	(symbol P2 P3)	
	(symbol P4 P5)
	
	(barrier_on L11)
	(barrier_button P5)
)
	
(:goal 
	(and
		(traveler_on_planet P7)
	)
)
)

; plan
1. (ciag-za-wajche-kronk l1 d1)
   added: (portal_open d1)
   goals met: 0 of 1
2. (portal-travel d1 p1 p2)
   deleted: (portal_open d1) (traveler_on_planet p1)
   added: (traveler_on_planet p2)
   goals met: 0 of 1
3. (ciag-za-wajche-kronk l3 d3)
   added: (portal_open d3)
   goals met: 0 of 1
4. (symbol-travel p2 p3)
   deleted: (traveler_on_planet p2)
   added: (traveler_on_planet p3)
   goals met: 0 of 1
5. (portal-travel d3 p3 p4)
   deleted: (portal_open d3) (traveler_on_planet p3)
   added: (traveler_on_planet p4)
   goals met: 0 of 1
6. (ciag-za-wajche-kronk l4 d4)
   added: (portal_open d4)
   goals met: 0 of 1
7. (symbol-travel p4 p5)
   deleted: (traveler_on_planet p4)
   added: (traveler_on_planet p5)
   goals met: 0 of 1
8. (push-button l11 p5)
   deleted: (barrier_on l11)
   goals met: 0 of 1
9. (ciag-za-wajche-kronk l5 d5)
   added: (portal_open d5)
   goals met: 0 of 1
10. (symbol-travel p5 p4)
   deleted: (traveler_on_planet p5)
   added: (traveler_on_planet p4)
   goals met: 0 of 1
11. (ciag-za-wajche-kronk l11 d1)
   added: (portal_open d1)
   goals met: 0 of 1
12. (symbol-travel p4 p5)
   deleted: (traveler_on_planet p4)
   added: (traveler_on_planet p5)
   goals met: 0 of 1
13. (portal-travel d4 p5 p3)
   deleted: (portal_open d4) (traveler_on_planet p5)
   added: (traveler_on_planet p3)
   goals met: 0 of 1
14. (symbol-travel p3 p2)
   deleted: (traveler_on_planet p3)
   added: (traveler_on_planet p2)
   goals met: 0 of 1
15. (portal-travel d1 p2 p1)
   deleted: (portal_open d1) (traveler_on_planet p2)
   added: (traveler_on_planet p1)
   goals met: 0 of 1
16. (portal-travel d5 p1 p6)
   deleted: (portal_open d5) (traveler_on_planet p1)
   added: (traveler_on_planet p6)
   goals met: 0 of 1
17. (ciag-za-wajche-kronk l6 d6)
   added: (portal_open d6)
   goals met: 0 of 1
18. (portal-travel d6 p6 p7)
   deleted: (portal_open d6) (traveler_on_planet p6)
   added: (traveler_on_planet p7)
   goals met: 1 of 1
